; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v1 ?v9)
             (pred_10 ?v11 ?v12)
             (pred_5 ?v1 ?v12)
             (pred_9 ?v5 ?v1 )
	     (pred_11 ?v1)
             (pred_12 ?v7)
             (pred_1 ?v11)
             (pred_6 ?v12)
             (pred_4 ?v1)
             (pred_7 ?v11)
             (pred_2 ?v1)
             (pred_3 ))



(:action op_4
:parameters (?v8 ?v2 ?v4 ?v13)
:precondition (and (pred_12 ?v8) (pred_12 ?v2) (pred_1 ?v4) (pred_6 ?v13)
          (pred_8 ?v8 ?v2) (pred_10 ?v4 ?v13)
                   (pred_5 ?v2 ?v13) (pred_11 ?v8) 
                   (pred_4 ?v2) (pred_7 ?v4))
:effect (and  (pred_2 ?v2) (not (pred_4 ?v2))))


(:action op_3
:parameters (?v8 ?v3)
:precondition (and (pred_12 ?v8) (pred_12 ?v3)
               (pred_11 ?v8) (pred_8 ?v8 ?v3) (pred_2 ?v3))
:effect (and (pred_11 ?v3) (not (pred_11 ?v8))))

(:action op_5
:parameters (?v8 ?v4)
:precondition (and (pred_12 ?v8) (pred_1 ?v4) 
                  (pred_11 ?v8) (pred_9 ?v4 ?v8) (pred_3 ))
:effect (and (pred_7 ?v4)
   (not (pred_9 ?v4 ?v8)) (not (pred_3 ))))


(:action op_1
:parameters (?v8 ?v6 ?v10)
:precondition (and (pred_12 ?v8) (pred_1 ?v6) (pred_1 ?v10)
                  (pred_11 ?v8) (pred_7 ?v10) (pred_9 ?v6 ?v8))
:effect (and (pred_7 ?v6) (pred_9 ?v10 ?v8)
        (not (pred_7 ?v10)) (not (pred_9 ?v6 ?v8))))

(:action op_2
:parameters (?v8 ?v4)
:precondition (and (pred_12 ?v8) (pred_1 ?v4) 
                  (pred_11 ?v8) (pred_7 ?v4))
:effect (and (pred_3 ) (pred_9 ?v4 ?v8) (not (pred_7 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_01 obj_18 obj_11 obj_10 obj_03 obj_07 obj_17 obj_06 obj_05 obj_02 obj_08 obj_16 obj_12 obj_04 obj_15
    obj_19 obj_14
    obj_20 obj_09
    )

    (:init
       (pred_3)

       (pred_12 obj_13)
       (pred_12 obj_01)
       (pred_12 obj_18)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_12 obj_03)
       (pred_12 obj_07)
       (pred_12 obj_17)
       (pred_12 obj_06)
       (pred_12 obj_05)
       (pred_12 obj_02)
       (pred_12 obj_08)
       (pred_12 obj_16)
       (pred_12 obj_12)
       (pred_12 obj_04)
       (pred_12 obj_15)
       (pred_6 obj_19)
       (pred_6 obj_14)
       (pred_1 obj_20)
       (pred_1 obj_09)

       (pred_8 obj_13 obj_10)
       (pred_8 obj_13 obj_01)
       (pred_8 obj_01 obj_03)
       (pred_8 obj_01 obj_18)
       (pred_8 obj_01 obj_13)
       (pred_8 obj_18 obj_07)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_18 obj_01)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_11 obj_18)
       (pred_8 obj_10 obj_06)
       (pred_8 obj_10 obj_03)
       (pred_8 obj_10 obj_13)
       (pred_8 obj_03 obj_05)
       (pred_8 obj_03 obj_07)
       (pred_8 obj_03 obj_01)
       (pred_8 obj_03 obj_10)
       (pred_8 obj_07 obj_02)
       (pred_8 obj_07 obj_17)
       (pred_8 obj_07 obj_18)
       (pred_8 obj_07 obj_03)
       (pred_8 obj_17 obj_08)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_17 obj_07)
       (pred_8 obj_06 obj_16)
       (pred_8 obj_06 obj_05)
       (pred_8 obj_06 obj_10)
       (pred_8 obj_05 obj_12)
       (pred_8 obj_05 obj_02)
       (pred_8 obj_05 obj_03)
       (pred_8 obj_05 obj_06)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_02 obj_08)
       (pred_8 obj_02 obj_07)
       (pred_8 obj_02 obj_05)
       (pred_8 obj_08 obj_15)
       (pred_8 obj_08 obj_17)
       (pred_8 obj_08 obj_02)
       (pred_8 obj_16 obj_12)
       (pred_8 obj_16 obj_06)
       (pred_8 obj_12 obj_04)
       (pred_8 obj_12 obj_05)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_04 obj_15)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_04 obj_12)
       (pred_8 obj_15 obj_08)
       (pred_8 obj_15 obj_04)
       (pred_4 obj_11)
       (pred_4 obj_12)
       (pred_5  obj_11 obj_19)
       (pred_5  obj_12 obj_14)
       (pred_2 obj_13)
       (pred_2 obj_01)
       (pred_2 obj_18)
       (pred_2 obj_10)
       (pred_2 obj_03)
       (pred_2 obj_07)
       (pred_2 obj_17)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_2 obj_02)
       (pred_2 obj_08)
       (pred_2 obj_16)
       (pred_2 obj_04)
       (pred_2 obj_15)

       (pred_10  obj_20 obj_19)
       (pred_10  obj_09 obj_14)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_09 obj_10)
       (pred_11 obj_08)
    )

    (:goal (and
       (pred_9 obj_09 obj_12)
    ))
(:constraints
  (always (not (pred_11 obj_05)))
)
)

; plan
1. (op_3 obj_08 obj_17)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_17)
   goals met: 0 of 1
2. (op_3 obj_17 obj_07)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_07)
   goals met: 0 of 1
3. (op_3 obj_07 obj_03)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_03)
   goals met: 0 of 1
4. (op_3 obj_03 obj_10)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_10)
   goals met: 0 of 1
5. (op_5 obj_10 obj_09)
   deleted: (pred_9 obj_09 obj_10) (pred_3)
   added: (pred_7 obj_09)
   goals met: 0 of 1
6. (op_3 obj_10 obj_06)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_06)
   goals met: 0 of 1
7. (op_3 obj_06 obj_16)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_16)
   goals met: 0 of 1
8. (op_4 obj_16 obj_12 obj_09 obj_14)
   deleted: (pred_4 obj_12)
   added: (pred_2 obj_12)
   goals met: 0 of 1
9. (op_3 obj_16 obj_12)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_12)
   goals met: 0 of 1
10. (op_2 obj_12 obj_09)
   deleted: (pred_7 obj_09)
   added: (pred_3) (pred_9 obj_09 obj_12)
   goals met: 1 of 1
